mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
/*  SPDX-License-Identifier: BSD-2-Clause OR GPL-3.0-or-later */
/*
 *  MacCAN - macOS User-Space Driver for USB-to-CAN Interfaces
 *
 *  Copyright (c) 2012-2024 Uwe Vogt, UV Software, Berlin (info@mac-can.com)
 *  All rights reserved.
 *
 *  This file is part of MacCAN-Core.
 *
 *  MacCAN-Core is dual-licensed under the BSD 2-Clause "Simplified" License
 *  and under the GNU General Public License v3.0 (or any later version).
 *  You can choose between one of them if you use this file.
 *
 *  BSD 2-Clause "Simplified" License:
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright notice, this
 *     list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright notice,
 *     this list of conditions and the following disclaimer in the documentation
 *     and/or other materials provided with the distribution.
 *
 *  MacCAN-Core IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 *  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 *  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 *  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 *  SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 *  CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 *  OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF MacCAN-Core, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *  GNU General Public License v3.0 or later:
 *  MacCAN-Core is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  MacCAN-Core is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with MacCAN-Core.  If not, see <https://www.gnu.org/licenses/>.
 */
#include "MacCAN_IOUsbKit.h"
#include "MacCAN_Devices.h"
#include "MacCAN_Internal.h"
#include "MacCAN_Debug.h"

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <assert.h>
#include <unistd.h>
#include <pthread.h>
#include <inttypes.h>

#include <mach/mach.h>
#include <mach/clock.h>

#include <IOKit/IOKitLib.h>
#include <IOKit/IOKitKeys.h>
#include <IOKit/IOMessage.h>
#include <IOKit/IOCFPlugIn.h>
#include <IOKit/IOReturn.h>
#include <IOKit/IOTypes.h>
#include <IOKit/usb/IOUSBLib.h>
#include <IOKit/usb/USBSpec.h>
#include <IOKit/usb/USB.h>

#include <CoreFoundation/CFRunLoop.h>
#include <CoreFoundation/CFDictionary.h>
#include <CoreFoundation/CFNumber.h>
#include <CoreFoundation/CFBase.h>
#include <CoreFoundation/CFPlugInCOM.h>

/*#define OPTION_MACCAN_MULTICHANNEL  0  !* set globally: 0 = only one channel on multi-channel devices */
/*#define OPTION_MACCAN_PIPE_TIMEOUT  0  !* set globally: 0 = do not use xxxPipeTO variant (e.g. macOS < 10.15) */
/*#define OPTION_MACCAN_PIPE_INFO  !* activate it, if needed (better use functions from 'MacCAN_IOUsbEP') */
/*#define OPTION_MACCAN_USB_STRINGS   0  !* set globally: 0 = indexed strings not supported */

#if (OPTION_MACCAN_MULTICHANNEL != 0)
#error Multi-channel feature not supported
#endif
#ifdef OPTION_MACCAN_PIPE_TIMEOUT
#if !defined(__MAC_11_0)
#undef OPTION_MACCAN_PIPE_TIMEOUT      /* xxxPipeTO() not available in macOS < 11 */
#endif
#endif
#ifndef OPTION_MACCAN_CLEAR_BOTH_ENDS
#if defined(__MAC_11_0)
#define OPTION_MACCAN_CLEAR_BOTH_ENDS  1  /* clear halt endpoint: 1 = both ends, 0 = only one end */
#else
#define OPTION_MACCAN_CLEAR_BOTH_ENDS  0  /* ClearPipeStallBothEnds() not available in macOS < 11 */
#endif
#endif
#ifdef OPTION_MACCAN_USB_STRINGS
#if !defined(__MAC_11_0)
#undef OPTION_MACCAN_USB_STRINGS       /* indexed strings are not available in macOS < 11 */
#endif
#define MAX_STRING_LENGTH  256
#endif
#ifndef CANUSB_MAX_DEVICES
#define CANUSB_MAX_DEVICES  42
#endif
#define MIN(x,y)  ((x) <= (y)) ? (x) : (y)

#define IS_INDEX_VALID(idx)  ((0 <= (idx)) && ((idx) < CANUSB_MAX_DEVICES))
#define IS_HANDLE_VALID(hnd)  IS_INDEX_VALID(hnd)

#define ENTER_CRITICAL_SECTION(idx)  assert(0 == pthread_mutex_lock(&usbDevice[idx].ptMutex))
#define LEAVE_CRITICAL_SECTION(idx)  assert(0 == pthread_mutex_unlock(&usbDevice[idx].ptMutex))

static void ReadPipeCallback(void *refCon, IOReturn result, void *arg0);
static void WritePipeCallback(void *refCon, IOReturn result, void *arg0);
static int SetupDirectory(SInt32 vendorID, SInt32 productID);
static void DeviceAdded(void *refCon, io_iterator_t iterator);
static void DeviceRemoved(void *refCon, io_iterator_t iterator);
static IOReturn ConfigureDevice(IOUSBDeviceInterface **dev);
static IOReturn FindInterface(IOUSBDeviceInterface **device, int index);
#if (OPTION_MACCAN_USB_STRINGS != 0)
static Boolean GetStringFromIndex(IOUSBDeviceInterface **dev, UInt8 idx, char *str, size_t n);
#endif
static void* WorkerThread(void* arg);

typedef struct usb_buffer_tag {             /* Double buffer: */
    UInt8 *data[2];                         /*   pointer to data buffers */
    UInt8 index;                            /*   index to active data buffer */
    UInt32 size;                            /*   size of each buffer (in byte) */
} CANUSB_Buffer_t;

typedef struct usb_async_pipe_tag {         /* Asynchrounous pipe: */
    UInt8 pipeRef;                          /*   pipe number (endpoint) */
    CANUSB_Handle_t handle;                 /*   device handle */
    CANUSB_Buffer_t buffer;                 /*   double buffer */
    CANUSB_AsyncPipeCbk_t callback;         /*   callback from notification function */
    CANUSB_Context_t context;               /*   pointer to user context for callback */
#if (OPTION_MACCAN_PIPE_TIMEOUT != 0)
    UInt32 noDataTimeout;                   /*   time-out (in [ms]) if no data is transferred */
    UInt32 completionTimeout;               /*   time-out (in [ms]) if the entire request is not completed */
#endif
    Boolean running;                        /*   flag to indicate the pipe state */
    UInt64 serviced;                        /*   counting callbacks (for debugging) */
} *CANUSB_AsyncPipe_t;                      /*   note: forward declaration requires C11 */

typedef struct usb_interface_tag {          /* USB interface: */
    Boolean fOpen;                          /*   interface is opened */
    UInt8 u8Class;                          /*   class of the interface (8-bit) */
    UInt8 u8SubClass;                       /*   subclass of the interface (8-bit) */
    UInt8 u8Protocol;                       /*   protocol of the interface (8-bit) */
    UInt8 u8NumEndpoints;                   /*   number of endpoints of the interface */
    IOUSBInterfaceInterface **ioInterface;  /*   interface interface (instance) */
    CANUSB_DetachedCbk_t cbkDeviceRemoved;  /*   callback when device has been removed */
    CANUSB_Context_t refDeviceRemoved;      /*   pointer to user context for callback */
} USBInterface_t;

typedef struct usb_device_tag {             /* USB device: */
    Boolean fPresent;                       /*   device is present */
    io_name_t szName;                       /*   device name */
    UInt16 u16VendorId;                     /*   vendor ID (16-bit) */
    UInt16 u16ProductId;                    /*   product ID (16-bit) */
    UInt16 u16ReleaseNo;                    /*   release no. (16-bit) */
    UInt8 nCanChannels;                     /*   "number of CAN channels" */
    UInt32 u32Location;                     /*   unique location ID (32-bit) */
    UInt16 u16Address;                      /*   device address (16-bit?) */
    IOUSBDeviceInterface **ioDevice;        /*   device interface (instance) */
    CANUSB_Descriptor_t ptrCanDevice;       /*   device descriptor (pointer) */
    USBInterface_t usbInterface/*[x]*/;     /*   interface interface (only first one supported) */
    pthread_mutex_t ptMutex;                /*   pthread mutex for mutual exclusion */
} USBDevice_t;

typedef struct usb_driver_tag {             /* USB driver: */
    Boolean fRunning;                       /*   flag: driver running */
    pthread_t ptThread;                     /*   pthread of the driver */
    pthread_mutex_t ptMutex;                /*   pthread mutex for mutual exclusion */
    CFRunLoopRef refRunLoop;                /*   run loop of the driver */
    IONotificationPortRef refNotifyPort;    /*   port for notifications */
    io_iterator_t iterBulkDevicePlugged;    /*   iterator for plugged device(s) */
    io_iterator_t iterBulkDeviceUnplugged;  /*   iterator for unplugged device(s) */
} USBDriver_t;

static USBDriver_t usbDriver;
static USBDevice_t usbDevice[CANUSB_MAX_DEVICES];
static CANUSB_Index_t idxDevice = 0;
static Boolean fInitialized = false;

CANUSB_Return_t CANUSB_Initialize(void) {
    int index, rc = -1;
    pthread_attr_t attr;
    Boolean running;
    time_t now;

    /* must not be initialized */
    if (fInitialized)
        return CANUSB_ERROR_YETINIT;

    /* initialize the driver and its devices */
    bzero(&usbDriver, sizeof(USBDriver_t));
    usbDriver.fRunning = false;
    for (index = 0; index < CANUSB_MAX_DEVICES; index++) {
        bzero(&usbDevice[index], sizeof(USBDevice_t));
        usbDevice[index].fPresent = false;
        /* create a mutex for each device */
        if (pthread_mutex_init(&usbDevice[index].ptMutex, NULL) != 0)
            goto error_initialize;
    }
    /* create a mutex and a thread for the driver */
    if (pthread_mutex_init(&usbDriver.ptMutex, NULL) != 0)
        goto error_initialize;
    if (pthread_attr_init(&attr) != 0)
        goto error_initialize;
    if (pthread_attr_setstacksize(&attr, 64*1024) != 0)
        goto error_initialize;
    if (pthread_attr_setinheritsched(&attr, PTHREAD_INHERIT_SCHED) != 0)
        goto error_initialize;
    if (pthread_attr_setschedpolicy(&attr, SCHED_RR) != 0)
        goto error_initialize;
    rc = pthread_create(&usbDriver.ptThread, &attr, WorkerThread, NULL);
    assert(pthread_attr_destroy(&attr) == 0);
    if (rc != 0)
        goto error_initialize;

    /* wait for the driver being loaded (by the created thread) or timed out */
    MACCAN_DEBUG_INFO("    Loading the MacCAN driver (v%u.%u.%u.%i)\n", 
                           CANUSB_GetCoreMajor(), CANUSB_GetCoreMinor(),
                           CANUSB_GetCorePatch(), CANUSB_GetCoreRevNo());
    fInitialized = true;
    now = time(NULL);
    do {
        CANUSB_Sleep(1000U);
        assert(0 == pthread_mutex_lock(&usbDriver.ptMutex));
        running = usbDriver.fRunning;
        assert(0 == pthread_mutex_unlock(&usbDriver.ptMutex));
    } while (!running && (time(NULL) < (now + 5/*seconds*/)));
    if (!running)
        goto error_runloop;
    
    /* the driver is now loaded (notifications will be received) */
    return CANUSB_SUCCESS;

