mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
error_runloop:
    /* on error: terminate the thread! */
    CFRunLoopStop(usbDriver.refRunLoop);
    (void)pthread_mutex_destroy(&usbDriver.ptMutex);
error_initialize:
    /* on error: tidy-up! */
    for (index = index - 1; index >= 0; index--)
        (void)pthread_mutex_destroy(&usbDevice[index].ptMutex);
    /* the driver has not been loaded! */
    fInitialized = false;
    return CANUSB_ERROR_NOTINIT;
}

CANUSB_Return_t CANUSB_Teardown(void) {
    int index;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;

    /* "Mr. Gorbachev, tear down this wall!" */
    MACCAN_DEBUG_INFO("    Release the MacCAN driver (v%u.%u.%u.%i)\n", 
                           CANUSB_GetCoreMajor(), CANUSB_GetCoreMinor(),
                           CANUSB_GetCorePatch(), CANUSB_GetCoreRevNo());
    CFRunLoopStop(usbDriver.refRunLoop);
    CANUSB_Sleep(54945U);  // TODO: check if this delay is necessary

    /* close all USB devices */
    for (index = 0; index < CANUSB_MAX_DEVICES; index++) {
        /* release the USB device */
        //MACCAN_DEBUG_FUNC("lock #%i\n", index);
        ENTER_CRITICAL_SECTION(index);
        if (usbDevice[index].fPresent &&
            (usbDevice[index].ioDevice != NULL)) {
            MACCAN_DEBUG_CORE("      - Device #%i: %s", index, usbDevice[index].szName);
            if (usbDevice[index].usbInterface.fOpen) {
                /* close the USB interface interface(s) */
                if (usbDevice[index].usbInterface.ioInterface) {
                    MACCAN_DEBUG_CODE(0, "close and release I/O interface\n");
                    (void)(*usbDevice[index].usbInterface.ioInterface)->USBInterfaceClose(usbDevice[index].usbInterface.ioInterface);
                    (void)(*usbDevice[index].usbInterface.ioInterface)->Release(usbDevice[index].usbInterface.ioInterface);
                    usbDevice[index].usbInterface.ioInterface = NULL;
                }
                /* close the USB device interface */
                MACCAN_DEBUG_CODE(0, "close I/O device\n");
                (void)(*usbDevice[index].ioDevice)->USBDeviceClose(usbDevice[index].ioDevice);
                usbDevice[index].usbInterface.fOpen = false;
            }
            /* rest in pease */
            MACCAN_DEBUG_CODE(0, "release I/O device\n");
            (void)(*usbDevice[index].ioDevice)->Release(usbDevice[index].ioDevice);
            usbDevice[index].ioDevice = NULL;
            usbDevice[index].fPresent = false;
            MACCAN_DEBUG_CORE(" (R.I.P.)\n");
        }
        LEAVE_CRITICAL_SECTION(index);
        //MACCAN_DEBUG_FUNC("unlocked\n");
        (void)pthread_mutex_destroy(&usbDevice[index].ptMutex);
    }
    (void)pthread_mutex_destroy(&usbDriver.ptMutex);
    fInitialized = false;
    return 0;
}

CANUSB_Return_t CANUSB_DeviceRequest(CANUSB_Index_t index, CANUSB_DeviceRequest_t request, void *buffer, UInt16 size, UInt32 *transferred) {
    IOUSBDevRequest ctrlRequest;
    IOReturn kr;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;

    bzero(&ctrlRequest, sizeof(IOUSBDevRequest));
    ctrlRequest.bmRequestType = request.RequestType;
    ctrlRequest.bRequest = request.Request;
    ctrlRequest.wValue = request.Value;
    ctrlRequest.wIndex = request.Index;
    ctrlRequest.wLength = request.Length;
    ctrlRequest.pData = buffer;
    ctrlRequest.wLenDone = 0;
    (void)size;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        kr = (*usbDevice[index].ioDevice)->DeviceRequest(usbDevice[index].ioDevice, &ctrlRequest);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Control transfer failed (%08x)\n", kr);
            LEAVE_CRITICAL_SECTION(index);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_ERROR_RESOURCE;
        }
        if (transferred)
            *transferred = ctrlRequest.wLenDone;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Handle_t CANUSB_OpenDevice(CANUSB_Index_t index, UInt16 vendorId, UInt16 productId) {
    IOReturn kr;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_INVALID_HANDLE;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_INVALID_HANDLE;

    /* open the USB device */
    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        if (!usbDevice[index].usbInterface.fOpen) {
            /* Find matching device by vendor id. and product id. (optional) */
            if ((vendorId != CANUSB_ANY_VENDOR_ID) && (productId != CANUSB_ANY_PRODUCT_ID)) {
                /* §1 by both vendor id. and product id. */
                if ((vendorId != usbDevice[index].u16VendorId) || (productId != usbDevice[index].u16ProductId)) {
                    MACCAN_DEBUG_ERROR("+++ Device #i doesn't match (vendor = %03x, product = %03x)\n", index, vendorId, productId);
                    LEAVE_CRITICAL_SECTION(index);
                    MACCAN_DEBUG_FUNC("unlocked\n");
                    return CANUSB_INVALID_HANDLE;
                }
            } else if (vendorId != CANUSB_ANY_VENDOR_ID) {
                /* §2 by vendor id. only */
                if (vendorId != usbDevice[index].u16VendorId) {
                    MACCAN_DEBUG_ERROR("+++ Device #i doesn't match (vendor = %03x)\n", index, vendorId);
                    LEAVE_CRITICAL_SECTION(index);
                    MACCAN_DEBUG_FUNC("unlocked\n");
                    return CANUSB_INVALID_HANDLE;
                }
            } else if (productId != CANUSB_ANY_PRODUCT_ID) {
                /* §3 both id.s don't care */
                MACCAN_DEBUG_ERROR("+++ Nope: vendor id. required (device #i, product = %03x)\n", index, productId);
                LEAVE_CRITICAL_SECTION(index);
                MACCAN_DEBUG_FUNC("unlocked\n");
                return CANUSB_INVALID_HANDLE;
            }
            /* Open the device for exclusive access */
            kr = (*usbDevice[index].ioDevice)->USBDeviceOpen(usbDevice[index].ioDevice);
            if (kIOReturnSuccess != kr) {
                MACCAN_DEBUG_ERROR("+++ Unable to open device #%i: %08x\n", index, kr);
                LEAVE_CRITICAL_SECTION(index);
                MACCAN_DEBUG_FUNC("unlocked\n");
                return CANUSB_INVALID_HANDLE;
            }
            /* Configure the device */
            kr = ConfigureDevice(usbDevice[index].ioDevice);
            if (kIOReturnSuccess != kr) {
                MACCAN_DEBUG_ERROR("+++ Unable to configure device #%i: %08x\n", index, kr);
                (void)(*usbDevice[index].ioDevice)->USBDeviceClose(usbDevice[index].ioDevice);
                usbDevice[index].usbInterface.fOpen = false;
                LEAVE_CRITICAL_SECTION(index);
                MACCAN_DEBUG_FUNC("unlocked\n");
                return CANUSB_INVALID_HANDLE;
            }
            /* Get the interfaces */
            kr = FindInterface(usbDevice[index].ioDevice, index);
            if (kIOReturnSuccess != kr) {
                MACCAN_DEBUG_ERROR("+++ Unable to find interfaces on device #%i: %08x\n", index, kr);
                (void)(*usbDevice[index].ioDevice)->USBDeviceClose(usbDevice[index].ioDevice);
                usbDevice[index].usbInterface.fOpen = false;
                LEAVE_CRITICAL_SECTION(index);
                MACCAN_DEBUG_FUNC("unlocked\n");
                return CANUSB_INVALID_HANDLE;
            }
            /* note: fOpen is true */
        } else {
            /* all CAN channels on the USB interface are in use */
            LEAVE_CRITICAL_SECTION(index);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_INVALID_HANDLE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Unable to open device #%i (device not present)\n", index);
        LEAVE_CRITICAL_SECTION(index);
        MACCAN_DEBUG_FUNC("unlocked\n");
        return CANUSB_INVALID_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");

