mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
    /* the handle is the index! */
    return (CANUSB_Handle_t)index;
}

CANUSB_Return_t CANUSB_CloseDevice(CANUSB_Handle_t handle) {
    IOReturn kr;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;

    /* close the USB device */
    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent) {
        if (usbDevice[handle].usbInterface.fOpen) {
            /* close the USB interface interface(s) */
            if (usbDevice[handle].usbInterface.ioInterface) {
                MACCAN_DEBUG_CODE(0, "close and release I/O interface\n");
                kr = (*usbDevice[handle].usbInterface.ioInterface)->USBInterfaceClose(usbDevice[handle].usbInterface.ioInterface);
                if (kIOReturnSuccess != kr) {
                    MACCAN_DEBUG_ERROR("+++ Unable to close I/O interface of device #%i: %08x\n", handle, kr);
                    // TODO: how to handle this?
                }
                kr = (*usbDevice[handle].usbInterface.ioInterface)->Release(usbDevice[handle].usbInterface.ioInterface);
                if (kIOReturnSuccess != kr) {
                    MACCAN_DEBUG_ERROR("+++ Unable to release I/O interface of device #%i: %08x\n", handle, kr);
                    // TODO: how to handle this?
                }
                usbDevice[handle].usbInterface.ioInterface = NULL;
            }
            /* Close the task�s connection to the device */
            if (usbDevice[handle].ioDevice) {
                MACCAN_DEBUG_CODE(0, "close I/O device\n");
                kr = (*usbDevice[handle].ioDevice)->USBDeviceClose(usbDevice[handle].ioDevice);
                if (kIOReturnSuccess != kr) {
                    MACCAN_DEBUG_ERROR("+++ Unable to close I/O device #%i: %08x\n", handle, kr);
                    LEAVE_CRITICAL_SECTION(handle);
                    MACCAN_DEBUG_FUNC("unlocked\n");
                    return CANUSB_ERROR_RESOURCE;
                }
            }
            /* the USB interface is now closed */
            usbDevice[handle].usbInterface.fOpen = false;
        } else {
            /* the USB interface is not open */
            ret = CANUSB_ERROR_NOTINIT;
        }
    } else {
        /* the USB device is not available */
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_RegisterDetachedCallback(CANUSB_Handle_t handle, CANUSB_DetachedCbk_t callback, CANUSB_Context_t context) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        usbDevice[handle].usbInterface.cbkDeviceRemoved = callback;
        usbDevice[handle].usbInterface.refDeviceRemoved = context;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (RegisterDetachedCallback)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_ReadPipe(CANUSB_Handle_t handle, UInt8 pipeRef, void *buffer, UInt32 *size, UInt16 timeout) {
    IOReturn kr;
    int ret = 0;
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
    (void)timeout;
#else
    UInt32 noDataTimeout = (UInt32)(((UInt32)timeout * (UInt32)2) / (UInt32)5);
    UInt32 completionTimeout = (UInt32)timeout;
#endif
    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!buffer || !size)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", handle, pipeRef);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
        /* note: deactivate define if ReadPipeTO() is not available in IOUSBInterfaceStructXYZ for the device. */
        kr = (*usbDevice[handle].usbInterface.ioInterface)->ReadPipe(usbDevice[handle].usbInterface.ioInterface,
                                                                     pipeRef, buffer, size);
#else
        if (timeout)
            kr = (*usbDevice[handle].usbInterface.ioInterface)->ReadPipeTO(usbDevice[handle].usbInterface.ioInterface,
                                                                           pipeRef, buffer, size,
                                                                           noDataTimeout, completionTimeout);
        else
            kr = (*usbDevice[handle].usbInterface.ioInterface)->ReadPipe(usbDevice[handle].usbInterface.ioInterface,
                                                                         pipeRef, buffer, size);
#endif
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to read pipe #%d (%08x)\n", pipeRef, kr);
            LEAVE_CRITICAL_SECTION(handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return (kIOUSBTransactionTimeout != kr) ? CANUSB_ERROR_RESOURCE : CANUSB_ERROR_TIMEOUT;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (ReadPipe)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

