mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
CANUSB_Return_t CANUSB_WritePipe(CANUSB_Handle_t handle, UInt8 pipeRef, const void *buffer, UInt32 size, UInt16 timeout) {
    IOReturn kr;
    int ret = 0;
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
    (void)timeout;
#else
    UInt32 noDataTimeout = (UInt32)timeout - (UInt32)(((UInt32)timeout * (UInt32)2) / (UInt32)5);
    UInt32 completionTimeout = (UInt32)timeout;
#endif
    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!buffer)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", handle, pipeRef);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        kr = (*usbDevice[handle].usbInterface.ioInterface)->GetPipeStatus(usbDevice[handle].usbInterface.ioInterface,
                                                                          pipeRef);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to get status of pipe #%d (%08x)\n", pipeRef, kr);
            LEAVE_CRITICAL_SECTION(handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return (kIOUSBPipeStalled != kr) ? CANUSB_ERROR_RESOURCE : CANUSB_ERROR_STALLED;
        }
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
        /* note: deactivate define if WritePipeTO() is not available in IOUSBInterfaceStructXYZ for the device. */
        kr = (*usbDevice[handle].usbInterface.ioInterface)->WritePipe(usbDevice[handle].usbInterface.ioInterface,
                                                                      pipeRef, (void*)buffer, size);
#else
        if (timeout)
            kr = (*usbDevice[handle].usbInterface.ioInterface)->WritePipeTO(usbDevice[handle].usbInterface.ioInterface,
                                                                            pipeRef, (void*)buffer, size,
                                                                            noDataTimeout, completionTimeout);
        else
            kr = (*usbDevice[handle].usbInterface.ioInterface)->WritePipe(usbDevice[handle].usbInterface.ioInterface,
                                                                          pipeRef, (void*)buffer, size);
#endif
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to write pipe #%d (%08x)\n", pipeRef, kr);
            LEAVE_CRITICAL_SECTION(handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return (kIOUSBTransactionTimeout != kr) ? CANUSB_ERROR_RESOURCE : CANUSB_ERROR_TIMEOUT;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (WritePipe)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}
    
CANUSB_Return_t CANUSB_ResetPipe(CANUSB_Handle_t handle, UInt8 pipeRef) {
    IOReturn kr;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;

    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", handle, pipeRef);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        kr = (*usbDevice[handle].usbInterface.ioInterface)->AbortPipe(usbDevice[handle].usbInterface.ioInterface,
                                                                      pipeRef);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to abort pipe #%d (%08x)\n", pipeRef, kr);
            LEAVE_CRITICAL_SECTION(handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_ERROR_RESOURCE;
        }
#if (OPTION_MACCAN_CLEAR_BOTH_ENDS == 0)
        kr = (*usbDevice[handle].usbInterface.ioInterface)->ClearPipeStall(usbDevice[handle].usbInterface.ioInterface,
                                                                           pipeRef);
#else
        kr = (*usbDevice[handle].usbInterface.ioInterface)->ClearPipeStallBothEnds(usbDevice[handle].usbInterface.ioInterface,
                                                                                   pipeRef);
#endif
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to clear pipe #%d (%08x)\n", pipeRef, kr);
            LEAVE_CRITICAL_SECTION(handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_ERROR_RESOURCE;
        }
        kr = (*usbDevice[handle].usbInterface.ioInterface)->GetPipeStatus(usbDevice[handle].usbInterface.ioInterface,
                                                                          pipeRef);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to get status of pipe #%d (%08x)\n", pipeRef, kr);
            LEAVE_CRITICAL_SECTION(handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_ERROR_RESOURCE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (ResetPipe)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_AsyncPipe_t CANUSB_CreatePipeAsync(CANUSB_Handle_t handle, UInt8 pipeRef, size_t bufferSize, Boolean doubleBuffer) {
    CANUSB_AsyncPipe_t asyncPipe = NULL;

    /* must be initialized */
    if (!fInitialized)
        return NULL;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return NULL;

    /* create asynchronous pipe context */
    if ((asyncPipe = (CANUSB_AsyncPipe_t)malloc(sizeof(struct usb_async_pipe_tag))) == NULL) {
        MACCAN_DEBUG_ERROR("+++ Unable to create asynchronous context for pipe #%u\n", pipeRef);
        return NULL;
    }
    bzero(asyncPipe, sizeof(struct usb_async_pipe_tag));
    asyncPipe->handle = CANUSB_INVALID_HANDLE;
    /* create buffer for USB data transfer */
    if (doubleBuffer) {
        MACCAN_DEBUG_CORE("        - Double buffer each of size %u bytes for pipe #%u\n", bufferSize, pipeRef);
        if ((asyncPipe->buffer.data[0] = malloc(bufferSize)) &&
            (asyncPipe->buffer.data[1] = malloc(bufferSize))) {
            asyncPipe->buffer.size = (UInt32)bufferSize;
            asyncPipe->callback = NULL;
            asyncPipe->context = NULL;
            asyncPipe->pipeRef = pipeRef;
            asyncPipe->handle = handle;
        } else {
            MACCAN_DEBUG_ERROR("+++ Unable to create double buffer (2 * %u bytes) for pipe #%u\n", bufferSize, pipeRef);
            free(asyncPipe);
            asyncPipe = NULL;
        }
    } else {
        MACCAN_DEBUG_CORE("        - Single buffer of size %u bytes for pipe #%u\n", bufferSize, pipeRef);
        if ((asyncPipe->buffer.data[0] = malloc(bufferSize))) {
            asyncPipe->buffer.size = (UInt32)bufferSize;
            asyncPipe->buffer.data[1] = NULL;
            asyncPipe->callback = NULL;
            asyncPipe->context = NULL;
            asyncPipe->pipeRef = pipeRef;
            asyncPipe->handle = handle;
        } else {
            MACCAN_DEBUG_ERROR("+++ Unable to create single buffer (1 * %u bytes) for pipe #%u\n", bufferSize, pipeRef);
            free(asyncPipe);
            asyncPipe = NULL;
        }
    }
    return asyncPipe;
}

CANUSB_Return_t CANUSB_DestroyPipeAsync(CANUSB_AsyncPipe_t asyncPipe) {

