mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* check for NULL pointer */
    if (!asyncPipe)
        return CANUSB_ERROR_NULLPTR;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(asyncPipe->handle))
        return CANUSB_ERROR_HANDLE;
    /* if running then abort */
    if (asyncPipe->running)
        (void)CANUSB_AbortPipeAsync(asyncPipe);

    MACCAN_DEBUG_CORE("    %8" PRIu64 " notification(s) of pipe #%u serviced\n", asyncPipe->serviced, asyncPipe->pipeRef);
    /* free buffer(s) and asynchronous pipe context */
    if (asyncPipe->buffer.data[1])
        free(asyncPipe->buffer.data[1]);
    if (asyncPipe->buffer.data[0])
        free(asyncPipe->buffer.data[0]);
    free(asyncPipe);

    return CANUSB_SUCCESS;
}

static void ReadPipeCallback(void *refCon, IOReturn result, void *arg0) {
    CANUSB_AsyncPipe_t asyncPipe = (CANUSB_AsyncPipe_t)refCon;
    UInt64 length = (arg0) ? (UInt64)arg0 : 0U;
    UInt8 *buffer, index;
    IOReturn kr;

    switch (result)
    {
    case kIOReturnSuccess:
        if (asyncPipe) {
            asyncPipe->serviced++;
            /* sanity check */
            if (!IS_HANDLE_VALID(asyncPipe->handle)) {
                asyncPipe->running = false;
                return;
            }
            if (!usbDevice[asyncPipe->handle].usbInterface.ioInterface) {
                asyncPipe->running = false;
                return;
            }
            if (!asyncPipe->buffer.data[0] || !asyncPipe->buffer.data[1]) {
                asyncPipe->running = false;
                return;
            }
            if (asyncPipe->buffer.index >= 2) {
                asyncPipe->running = false;
                return;
            }
            /* double-buffer strategy */
            index = asyncPipe->buffer.index;
            buffer = asyncPipe->buffer.data[index];
            asyncPipe->buffer.index = index ? 0 : 1;
            /* preparation of the next asynchronous pipe read event (with our pipe context as reference, 6th argument) */
            kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->ReadPipeAsync(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                         asyncPipe->pipeRef,
                                                                                         asyncPipe->buffer.data[asyncPipe->buffer.index],
                                                                                         asyncPipe->buffer.size,
                                                                                         ReadPipeCallback,
                                                                                         (void *)asyncPipe);
            if (kIOReturnSuccess != kr) {
                MACCAN_DEBUG_ERROR("+++ Unable to read async pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, kr);
                /* error: pipe is boken */
                asyncPipe->running = false;
            }
            /* call the CALLBACK routine with the referenced pipe context */
            if (asyncPipe->callback && length) {
                (void)asyncPipe->callback(asyncPipe->context, buffer, (UInt32)length);
            }
        } else {
            MACCAN_DEBUG_ERROR("+++ Error: read async pipe without context (%08x)\n", result);
        }
        break;
    case kIOReturnAborted:
        if (asyncPipe) {
            MACCAN_DEBUG_CORE("!!! Aborted: read async pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, result);
            asyncPipe->running = false;
        } else {
            MACCAN_DEBUG_CORE("!!! Aborted: read async pipe without context (%08x)\n", result);
        }
        break;
    default:
        if (asyncPipe) {
            MACCAN_DEBUG_ERROR("+++ Error: read async pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, result);
            asyncPipe->running = false;
        } else {
            MACCAN_DEBUG_ERROR("+++ Error: read async pipe without context (%08x)\n", result);
        }
        break;
    }
    return;
}

CANUSB_Return_t CANUSB_ReadPipeAsync(CANUSB_AsyncPipe_t asyncPipe, CANUSB_AsyncPipeCbk_t callback, CANUSB_Context_t context) {
    IOReturn kr;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* check for NULL pointer */
    if (!asyncPipe ||
        !asyncPipe->buffer.data[0] ||
        !asyncPipe->buffer.data[1])
        return CANUSB_ERROR_NULLPTR;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(asyncPipe->handle))
        return CANUSB_ERROR_HANDLE;

    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", asyncPipe->handle, asyncPipe->pipeRef);
    ENTER_CRITICAL_SECTION(asyncPipe->handle);
    if (asyncPipe->running) {
        MACCAN_DEBUG_ERROR("+++ Async read of pipe #%d already started\n", asyncPipe->pipeRef);
        LEAVE_CRITICAL_SECTION(asyncPipe->handle);
        MACCAN_DEBUG_FUNC("unlocked\n");
        return CANUSB_ERROR_RESOURCE;
    }
    if (usbDevice[asyncPipe->handle].fPresent &&
        (usbDevice[asyncPipe->handle].usbInterface.fOpen) &&
        (usbDevice[asyncPipe->handle].usbInterface.ioInterface != NULL)) {
        /* register the callback function and the reception data context */
        asyncPipe->callback = callback;
        asyncPipe->context = context;
        /* preparation of the first asynchronous pipe read event (with our pipe context as reference, 6th argument) */
        kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->ReadPipeAsync(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                     asyncPipe->pipeRef,
                                                                                     asyncPipe->buffer.data[asyncPipe->buffer.index],
                                                                                     asyncPipe->buffer.size,
                                                                                     ReadPipeCallback,
                                                                                     (void*)asyncPipe);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to start async read pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, kr);
            LEAVE_CRITICAL_SECTION(asyncPipe->handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_ERROR_RESOURCE;
        }
        /* asynchronous pipe read event armed */
        asyncPipe->running = true;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (ReadPipeAsync)\n", asyncPipe->handle);
        ret = !usbDevice[asyncPipe->handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(asyncPipe->handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

