mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
CANUSB_Return_t CANUSB_AbortPipeAsync(CANUSB_AsyncPipe_t asyncPipe) {
    IOReturn kr;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* check for NULL pointer */
    if (!asyncPipe)
        return CANUSB_ERROR_NULLPTR;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(asyncPipe->handle))
        return CANUSB_ERROR_HANDLE;

    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", asyncPipe->handle, asyncPipe->pipeRef);
    ENTER_CRITICAL_SECTION(asyncPipe->handle);
    if (usbDevice[asyncPipe->handle].fPresent &&
        (usbDevice[asyncPipe->handle].usbInterface.fOpen) &&
        (usbDevice[asyncPipe->handle].usbInterface.ioInterface != NULL)) {
        kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->AbortPipe(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                 asyncPipe->pipeRef);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to abort async pipe #%d (%08x)\n", asyncPipe->pipeRef, kr);
            LEAVE_CRITICAL_SECTION(asyncPipe->handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return CANUSB_ERROR_RESOURCE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (AbortPipeAsync #%d)\n", asyncPipe->handle, asyncPipe->pipeRef);
        ret = !usbDevice[asyncPipe->handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(asyncPipe->handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

static void WritePipeCallback(void *refCon, IOReturn result, void *arg0) {
    CANUSB_AsyncPipe_t asyncPipe = (CANUSB_AsyncPipe_t)refCon;
    IOReturn kr;

    (void)arg0;

    switch(result)
    {
    case kIOReturnSuccess:
        if (asyncPipe) {
            asyncPipe->serviced++;
            /* sanity check */
            if (!IS_HANDLE_VALID(asyncPipe->handle)) {
                asyncPipe->running = false;
                return;
            }
            if (!usbDevice[asyncPipe->handle].usbInterface.ioInterface) {
                asyncPipe->running = false;
                return;
            }
            if (!asyncPipe->buffer.data[0]) {
                asyncPipe->running = false;
                return;
            }
            /* check if there are more data to be sent */
            if (asyncPipe->callback &&
                asyncPipe->callback(asyncPipe->context, asyncPipe->buffer.data[0], asyncPipe->buffer.size)) {
                /* preparation of the next asynchronous pipe write event (with our pipe context as reference, 8th resp. 6th argument) */
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
                kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->WritePipeAsync(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                              asyncPipe->pipeRef,
                                                                                              asyncPipe->buffer.data[0],
                                                                                              asyncPipe->buffer.size,
                                                                                              WritePipeCallback,
                                                                                              (void*)asyncPipe);
#else
                if (asyncPipe->noDataTimeout && asyncPipe->completionTimeout)
                    kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->WritePipeAsyncTO(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                                    asyncPipe->pipeRef,
                                                                                                    asyncPipe->buffer.data[0],
                                                                                                    asyncPipe->buffer.size,
                                                                                                    asyncPipe->noDataTimeout,
                                                                                                    asyncPipe->completionTimeout,
                                                                                                    WritePipeCallback,
                                                                                                    (void*)asyncPipe);
                else
                    kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->WritePipeAsync(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                                  asyncPipe->pipeRef,
                                                                                                  asyncPipe->buffer.data[0],
                                                                                                  asyncPipe->buffer.size,
                                                                                                  WritePipeCallback,
                                                                                                  (void*)asyncPipe);
#endif
                if (kIOReturnSuccess != kr) {
                    MACCAN_DEBUG_ERROR("+++ Unable to write async pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, kr);
                    /* error: something went wrong */
                    asyncPipe->running = false;
                } else {
                    /* success: write event armed */
                    asyncPipe->running = true;
                }
            } else {
                /* no more data to be sent */
                asyncPipe->running = false;
            }
        } else {
            MACCAN_DEBUG_CORE("+++ Error: write async pipe without context (%08x)\n", result);
        }
        break;
    case kIOReturnAborted:
        if (asyncPipe) {
            MACCAN_DEBUG_CORE("!!! Aborted: write async pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, result);
            asyncPipe->running = false;
        } else {
            MACCAN_DEBUG_CORE("!!! Aborted: write async pipe without context (%08x)\n", result);
        }
        break;
    default:
        if (asyncPipe) {
            MACCAN_DEBUG_ERROR("+++ Error: write async pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, result);
            asyncPipe->running = false;
        } else {
            MACCAN_DEBUG_ERROR("+++ Error: write async pipe without context (%08x)\n", result);
        }
        break;
    }
    return;
}

CANUSB_Return_t CANUSB_WritePipeAsync(CANUSB_AsyncPipe_t asyncPipe, const void *buffer, UInt32 size, UInt16 timeout,
                                      CANUSB_AsyncPipeCbk_t callback, CANUSB_Context_t context) {
    IOReturn kr;
    int ret = 0;
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
    (void)timeout;
#else
    UInt32 noDataTimeout = (UInt32)(((UInt32)timeout * (UInt32)2) / (UInt32)5);
    UInt32 completionTimeout = (UInt32)timeout;
#endif
    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* check for NULL pointer */
    if (!asyncPipe || !buffer ||
        !asyncPipe->buffer.data[0])
        return CANUSB_ERROR_NULLPTR;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(asyncPipe->handle))
        return CANUSB_ERROR_HANDLE;

    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", asyncPipe->handle, asyncPipe->pipeRef);
    ENTER_CRITICAL_SECTION(asyncPipe->handle);
    if (asyncPipe->running) {
        MACCAN_DEBUG_ERROR("+++ Async write of pipe #%d already started\n", asyncPipe->pipeRef);
        LEAVE_CRITICAL_SECTION(asyncPipe->handle);
        MACCAN_DEBUG_FUNC("unlocked\n");
        return CANUSB_ERROR_RESOURCE;
    }
    if (usbDevice[asyncPipe->handle].fPresent &&
        (usbDevice[asyncPipe->handle].usbInterface.fOpen) &&
        (usbDevice[asyncPipe->handle].usbInterface.ioInterface != NULL)) {
        kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->GetPipeStatus(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                     asyncPipe->pipeRef);
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to get status of pipe #%d (%08x)\n", asyncPipe->pipeRef, kr);
            LEAVE_CRITICAL_SECTION(asyncPipe->handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return (kIOUSBPipeStalled != kr) ? CANUSB_ERROR_RESOURCE : CANUSB_ERROR_STALLED;
        }
        /* copy data into the transfer buffer (at index 0) */
        bzero(asyncPipe->buffer.data[0], (size_t)asyncPipe->buffer.size);
        memcpy(asyncPipe->buffer.data[0], buffer, (size_t)MIN(size, asyncPipe->buffer.size));
        asyncPipe->buffer.index = 0;
        /* register the callback function and the transmission data context */
        asyncPipe->callback = callback;
        asyncPipe->context = context;
        /* preparation of the asynchronous pipe write event (with our pipe context as reference, 6th or 8th argument) */
#if (OPTION_MACCAN_PIPE_TIMEOUT == 0)
        /* note: deactivate define if WritePipeAsyncTO() is not available in IOUSBInterfaceStructXYZ for the device. */
        kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->WritePipeAsync(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                      asyncPipe->pipeRef,
                                                                                      asyncPipe->buffer.data[0],
                                                                                      asyncPipe->buffer.size,
                                                                                      WritePipeCallback,
                                                                                      (void*)asyncPipe);
#else
        /* register also the time-out values */
        asyncPipe->noDataTimeout = noDataTimeout;
        asyncPipe->completionTimeout = completionTimeout;
        /* start the transmission pump (w/ or w/o time-out) */
        if (timeout)
            kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->WritePipeAsyncTO(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                            asyncPipe->pipeRef,
                                                                                            asyncPipe->buffer.data[0],
                                                                                            asyncPipe->buffer.size,
                                                                                            asyncPipe->noDataTimeout,
                                                                                            asyncPipe->completionTimeout,
                                                                                            WritePipeCallback,
                                                                                            (void*)asyncPipe);
        else
            kr = (*usbDevice[asyncPipe->handle].usbInterface.ioInterface)->WritePipeAsync(usbDevice[asyncPipe->handle].usbInterface.ioInterface,
                                                                                          asyncPipe->pipeRef,
                                                                                          asyncPipe->buffer.data[0],
                                                                                          asyncPipe->buffer.size,
                                                                                          WritePipeCallback,
                                                                                          (void*)asyncPipe);
#endif
        if (kIOReturnSuccess != kr) {
            MACCAN_DEBUG_ERROR("+++ Unable to start async write pipe #%d of device #%d (%08x)\n", asyncPipe->pipeRef, asyncPipe->handle, kr);
            LEAVE_CRITICAL_SECTION(asyncPipe->handle);
            MACCAN_DEBUG_FUNC("unlocked\n");
            return (kIOUSBTransactionTimeout != kr) ? CANUSB_ERROR_RESOURCE : CANUSB_ERROR_TIMEOUT;
        }
        /* asynchronous pipe write event armed */
        asyncPipe->running = true;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (WritePipeAsync)\n", asyncPipe->handle);
        ret = !usbDevice[asyncPipe->handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(asyncPipe->handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

Boolean CANUSB_IsPipeAsyncRunning(CANUSB_AsyncPipe_t asyncPipe) {
    Boolean running = false;

