mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
    /* must be initialized */
    if (!fInitialized)
        return false;
    /* check for NULL pointer */
    if (!asyncPipe)
        return false;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(asyncPipe->handle))
        return false;

    /* return true if asynchronous operation is running, false otherwise */
    MACCAN_DEBUG_FUNC("lock #%i (%u)\n", asyncPipe->handle, asyncPipe->pipeRef);
    ENTER_CRITICAL_SECTION(asyncPipe->handle);
    running = asyncPipe->running;
    LEAVE_CRITICAL_SECTION(asyncPipe->handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return running;
}

CANUSB_Index_t CANUSB_MaxDevices(void) {
    /* number of maximum devices */
    return (CANUSB_Index_t)(fInitialized ? CANUSB_MAX_DEVICES : 0);
}

CANUSB_Index_t CANUSB_GetFirstDevice(void) {
    CANUSB_Index_t index = CANUSB_INVALID_INDEX;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_INVALID_INDEX;

    /* get the first registered device, if any */
    // if (idxDevice != 0)  // note: logically equivalent
        idxDevice = 0;
    while (idxDevice < CANUSB_MAX_DEVICES) {
        if (usbDevice[idxDevice].fPresent &&
            (usbDevice[idxDevice].ioDevice != NULL)) {
            index = idxDevice;
            break;
        }
        idxDevice++;
    }
    return index;
}

CANUSB_Index_t CANUSB_GetNextDevice(void) {
    CANUSB_Index_t index = CANUSB_INVALID_INDEX;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_INVALID_INDEX;

    /* get the next registered device, if any */
    if (idxDevice < CANUSB_MAX_DEVICES)
        idxDevice += 1;
    while (idxDevice < CANUSB_MAX_DEVICES) {
        if (usbDevice[idxDevice].fPresent &&
            (usbDevice[idxDevice].ioDevice != NULL)) {
            index = idxDevice;
            break;
        }
        idxDevice++;
    }
    return index;
}

Boolean CANUSB_IsDevicePresent(CANUSB_Index_t index) {
    Boolean ret = false;

    /* must be initialized */
    if (!fInitialized)
        return false;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return false;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL))
        ret = true;
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

Boolean CANUSB_IsDeviceInUse(CANUSB_Index_t index) {
    Boolean ret = false;
    IOReturn kr;

    /* must be initialized */
    if (!fInitialized)
        return false;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return false;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        if (usbDevice[index].usbInterface.fOpen &&
            (usbDevice[index].usbInterface.ioInterface != NULL))
            ret = true;
        else {
            /* check if the device is used by another process by trying to open it in exclusive mode*/
            kr = (*usbDevice[index].ioDevice)->USBDeviceOpen(usbDevice[index].ioDevice);
            if (kIOReturnSuccess == kr)  /* note: if not then close the device immediately! */
                (void)(*usbDevice[index].ioDevice)->USBDeviceClose(usbDevice[index].ioDevice);
            ret = (kIOReturnSuccess != kr) ? true : false;
        }
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

Boolean CANUSB_IsDeviceOpened(CANUSB_Index_t index) {
    Boolean ret = false;

    /* must be initialized */
    if (!fInitialized)
        return false;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return false;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL) &&
        (usbDevice[index].usbInterface.fOpen) &&
        (usbDevice[index].usbInterface.ioInterface != NULL))
        ret = true;
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceState(CANUSB_Index_t index, CANUSB_DeviceState_t *state) {
    int ret = 0;
    IOReturn kr;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!state)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        if (usbDevice[index].usbInterface.fOpen &&
            (usbDevice[index].usbInterface.ioInterface != NULL)) {
            /* device used by own process */
            *state = CANUSB_DEVICE_ATTACHED;
            ret = CANUSB_SUCCESS;
        } else {
            /* check if the device is used by another process by trying to open it in exclusive mode */
            kr = (*usbDevice[index].ioDevice)->USBDeviceOpen(usbDevice[index].ioDevice);
            if (kIOReturnSuccess == kr)  /* note: if successful then close the device immediately! */
                (void)(*usbDevice[index].ioDevice)->USBDeviceClose(usbDevice[index].ioDevice);
            *state = (kIOReturnSuccess != kr) ? CANUSB_DEVICE_HIJACKED : CANUSB_DEVICE_AVAILABLE;
            ret = CANUSB_SUCCESS;
        }
    } else {
        *state = CANUSB_DEVICE_UNAVAILABLE;
        ret = CANUSB_SUCCESS;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceUsbName(CANUSB_Index_t index, char *buffer, size_t n) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!buffer)
        return CANUSB_ERROR_NULLPTR;
    /* empty string for the error case */
    bzero(buffer, n);

