mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        if (n > 0U) {
            strncpy(buffer, usbDevice[index].szName, n);
            buffer[(n - 1U)] = '\0';
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

#if (OPTION_MACCAN_USB_STRINGS != 0)
CANUSB_Return_t CANUSB_GetDeviceVendorName(CANUSB_Index_t index, char *buffer, size_t n) {
    /*
     * note: USBGetManufacturerStringIndex() is not available in OS X before 10.15!
     */
    int ret = 0;
    UInt8    si;
    IOReturn kr;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!buffer)
        return CANUSB_ERROR_NULLPTR;
    /* empty string for the error case */
    bzero(buffer, n);

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        kr = (*usbDevice[index].ioDevice)->USBGetManufacturerStringIndex(usbDevice[index].ioDevice, &si);
        if ((kIOReturnSuccess == kr) && (si != 0)) {
            ret = GetStringFromIndex(usbDevice[index].ioDevice, si, buffer, n) ? CANUSB_SUCCESS : CANUSB_ERROR_RESOURCE;
        } else {
            MACCAN_DEBUG_ERROR("+++ Sorry, device #%i has no manufacturer string index\n", index);
            ret = CANUSB_ERROR_RESOURCE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceProductName(CANUSB_Index_t index, char *buffer, size_t n) {
    /*
     * note: USBGetProductStringIndex() is not available in OS X before 10.15!
     */
    int ret = 0;
    UInt8    si;
    IOReturn kr;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!buffer)
        return CANUSB_ERROR_NULLPTR;
    /* empty string for the error case */
    bzero(buffer, n);

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        kr = (*usbDevice[index].ioDevice)->USBGetProductStringIndex(usbDevice[index].ioDevice, &si);
        if ((kIOReturnSuccess == kr) && (si != 0)) {
            ret = GetStringFromIndex(usbDevice[index].ioDevice, si, buffer, n) ? CANUSB_SUCCESS : CANUSB_ERROR_RESOURCE;
        } else {
            MACCAN_DEBUG_ERROR("+++ Sorry, device #%i has no product string index\n", index);
            ret = CANUSB_ERROR_RESOURCE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceSerialNumber(CANUSB_Index_t index, char *buffer, size_t n) {
    /*
     * note: USBGetSerialNumberStringIndex() is not available in OS X before 10.15!
     */
    int ret = 0;
    UInt8    si;
    IOReturn kr;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!buffer)
        return CANUSB_ERROR_NULLPTR;
    /* empty string for the error case */
    bzero(buffer, n);
    
    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        kr = (*usbDevice[index].ioDevice)->USBGetSerialNumberStringIndex(usbDevice[index].ioDevice, &si);
        if ((kIOReturnSuccess == kr) && (si != 0)) {
            ret = GetStringFromIndex(usbDevice[index].ioDevice, si, buffer, n) ? CANUSB_SUCCESS : CANUSB_ERROR_RESOURCE;
        } else {
            MACCAN_DEBUG_ERROR("+++ Sorry, device #%i has no serial number string index\n", index);
            ret = CANUSB_ERROR_RESOURCE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}
#endif

CANUSB_Return_t CANUSB_GetDeviceVendorId(CANUSB_Index_t index, UInt16 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        *value = usbDevice[index].u16VendorId;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceProductId(CANUSB_Index_t index, UInt16 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        *value = usbDevice[index].u16ProductId;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceReleaseNo(CANUSB_Index_t index, UInt16 *value) {
    int ret = 0;

