mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        *value = usbDevice[index].u16ReleaseNo;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceLocation(CANUSB_Index_t index, UInt32 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        *value = usbDevice[index].u32Location;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceAddress(CANUSB_Index_t index, UInt16 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        *value = usbDevice[index].u16Address;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceNumCanChannels(CANUSB_Index_t index, UInt8 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        *value = (UInt8)usbDevice[index].nCanChannels;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetDeviceCanDescriptor(CANUSB_Index_t index, CANUSB_Descriptor_t descriptor, size_t size) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid index */
    if (!IS_INDEX_VALID(index))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!descriptor)
        return CANUSB_ERROR_NULLPTR;
    /* empty descriptor for the error case */
    bzero(descriptor, size);

    MACCAN_DEBUG_FUNC("lock #%i\n", index);
    ENTER_CRITICAL_SECTION(index);
    if (usbDevice[index].fPresent &&
        (usbDevice[index].ioDevice != NULL)) {
        if (usbDevice[index].ptrCanDevice) {
            memcpy(descriptor, usbDevice[index].ptrCanDevice, size);
        } else {
            MACCAN_DEBUG_ERROR("+++ Sorry, device #%i has no CAN descriptor\n", index);
            ret = CANUSB_ERROR_RESOURCE;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not available\n", index);
        ret = CANUSB_ERROR_HANDLE;
    }
    LEAVE_CRITICAL_SECTION(index);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceClass(CANUSB_Handle_t handle, UInt8 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        *value = usbDevice[handle].usbInterface.u8Class;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceClass)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceSubClass(CANUSB_Handle_t handle, UInt8 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        *value = usbDevice[handle].usbInterface.u8SubClass;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceSubClass)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceProtocol(CANUSB_Handle_t handle, UInt8 *value) {
    int ret = 0;

