mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        *value = usbDevice[handle].usbInterface.u8Protocol;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceProtocol)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceNumEndpoints(CANUSB_Handle_t handle, UInt8 *value) {
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        *value = usbDevice[handle].usbInterface.u8NumEndpoints;
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceNumEndpoints)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceEndpointDirection(CANUSB_Handle_t handle, UInt8 index, UInt8 *value) {
    IOReturn        kr2;
    UInt8           direction;
    UInt8           number;
    UInt8           transferType;
    UInt16          maxPacketSize;
    UInt8           interval;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        kr2 = (*usbDevice[handle].usbInterface.ioInterface)->GetPipeProperties(usbDevice[handle].usbInterface.ioInterface,
                index, &direction, &number, &transferType, &maxPacketSize, &interval);
        if (kIOReturnSuccess != kr2) {
            MACCAN_DEBUG_ERROR("+++ Unable to get properties of pipe #%i (%08x)\n", index, kr2);
            ret = CANUSB_ERROR_RESOURCE;
        } else {
            /* 0 = out / 1 = in / 2 = none */
            *value = direction;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceEndpointDirection)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceEndpointTransferType(CANUSB_Handle_t handle, UInt8 index, UInt8 *value) {
    IOReturn        kr2;
    UInt8           direction;
    UInt8           number;
    UInt8           transferType;
    UInt16          maxPacketSize;
    UInt8           interval;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        kr2 = (*usbDevice[handle].usbInterface.ioInterface)->GetPipeProperties(usbDevice[handle].usbInterface.ioInterface,
                index, &direction, &number, &transferType, &maxPacketSize, &interval);
        if (kIOReturnSuccess != kr2) {
            MACCAN_DEBUG_ERROR("+++ Unable to get properties of pipe #%i (%08x)\n", index, kr2);
            ret = CANUSB_ERROR_RESOURCE;
        } else {
            /* 0 = Control / 1 = ISOC / 2 = Bulk / 3 = Interrupt */
            *value = transferType;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceEndpointTransferType)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

CANUSB_Return_t CANUSB_GetInterfaceEndpointMaxPacketSize(CANUSB_Handle_t handle, UInt8 index, UInt16 *value) {
    IOReturn        kr2;
    UInt8           direction;
    UInt8           number;
    UInt8           transferType;
    UInt16          maxPacketSize;
    UInt8           interval;
    int ret = 0;

    /* must be initialized */
    if (!fInitialized)
        return CANUSB_ERROR_NOTINIT;
    /* must be a valid handle */
    if (!IS_HANDLE_VALID(handle))
        return CANUSB_ERROR_HANDLE;
    /* check for NULL pointer */
    if (!value)
        return CANUSB_ERROR_NULLPTR;

    MACCAN_DEBUG_FUNC("lock #%i\n", handle);
    ENTER_CRITICAL_SECTION(handle);
    if (usbDevice[handle].fPresent &&
        (usbDevice[handle].ioDevice != NULL) &&
        (usbDevice[handle].usbInterface.fOpen) &&
        (usbDevice[handle].usbInterface.ioInterface != NULL)) {
        kr2 = (*usbDevice[handle].usbInterface.ioInterface)->GetPipeProperties(usbDevice[handle].usbInterface.ioInterface,
                index, &direction, &number, &transferType, &maxPacketSize, &interval);
        if (kIOReturnSuccess != kr2) {
            MACCAN_DEBUG_ERROR("+++ Unable to get properties of pipe #%i (%08x)\n", index, kr2);
            ret = CANUSB_ERROR_RESOURCE;
        } else {
            /* as a 16-bit value */
            *value = maxPacketSize;
        }
    } else {
        MACCAN_DEBUG_ERROR("+++ Sorry, device #%i is not open or not available (GetInterfaceEndpointMaxPacketSize)\n", handle);
        ret = !usbDevice[handle].fPresent ? CANUSB_ERROR_HANDLE : CANUSB_ERROR_NOTINIT;
    }
    LEAVE_CRITICAL_SECTION(handle);
    MACCAN_DEBUG_FUNC("unlocked\n");
    return ret;
}

#if (OPTION_MACCAN_USB_STRINGS != 0)
static Boolean GetStringFromIndex(IOUSBDeviceInterface **dev, UInt8 idx, char *str, size_t n) {
    /*
     * note: Access to indexed strings are not available in OS X before 10.15!
     */
    IOUSBDevRequest ctrlRequest;
    IOReturn        kr;
    
    char buffer[MAX_STRING_LENGTH+1];
    bzero(buffer, MAX_STRING_LENGTH+1);
    
    ctrlRequest.bmRequestType = USBmakebmRequestType(kUSBIn, kUSBStandard, kUSBDevice);
    ctrlRequest.bRequest      = kUSBRqGetDescriptor;
    ctrlRequest.wValue        = (kUSBStringDesc << 8) | idx;
    ctrlRequest.wIndex        = 0x409;
    ctrlRequest.pData         = (void*)buffer;
    ctrlRequest.wLength       = (UInt16)MAX_STRING_LENGTH;

    kr = (*dev)->DeviceRequest(dev, &ctrlRequest);
    if (kIOReturnSuccess != kr) {
        MACCAN_DEBUG_ERROR("+++ Unable to request the string at index #%i (%08x)\n", idx, kr);
        return false;
    }
    if (str == NULL || n == 0 || ctrlRequest.wLenDone <= 2) {
        return true;
    }
    CFStringRef cfstr = CFStringCreateWithBytes(NULL, (const UInt8 *)buffer+2, ctrlRequest.wLenDone-2, kCFStringEncodingUTF16LE, false);
    CFIndex     len   = CFStringGetMaximumSizeForEncoding(CFStringGetLength(cfstr), kCFStringEncodingUTF8) + 1;
    if (len >= 0) {
        CFStringGetCString(cfstr, buffer, len, kCFStringEncodingUTF8);
        strncpy(str, buffer, n);
        str[n-1] = '\0';
    }
    CFRelease(cfstr);
    return true;
}
#endif

