mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
/*
 *  Working with USB Device Interfaces on macOS
 *  See https://developer.apple.com/library/archive/documentation/DeviceDrivers/Conceptual/USBBook
 *  Revision of 2012-01-09
 */
static int SetupDirectory(SInt32 vendorID, SInt32 productID)
{
    mach_port_t             masterPort;
    CFMutableDictionaryRef  matchingDict;
    CFNumberRef             numberRef;
    CFRunLoopSourceRef      runLoopSource;
    kern_return_t           kr;

    /* Create a master port for communication with the I/O Kit */
#if defined(__MAC_12_0) && (__MAC_OS_X_VERSION_MIN_REQUIRED >= __MAC_12_0)
    kr = IOMainPort(MACH_PORT_NULL, &masterPort);
#else
    /*  'IOMasterPort' is deprecated: first deprecated in macOS 12.0 */
    kr = IOMasterPort(MACH_PORT_NULL, &masterPort);
#endif
    if (kr || !masterPort)
    {
        MACCAN_DEBUG_ERROR("+++ Couldn't create a master I/O Kit port (%08x)\n", kr);
        return CANUSB_ERROR_FATAL;
    }
    /* Set up matching dictionary for class IOUSBDevice and its subclasses */
    matchingDict = IOServiceMatching(kIOUSBDeviceClassName);
    if (matchingDict == NULL)
    {
        MACCAN_DEBUG_ERROR("+++ Couldn't create a USB matching dictionary\n");
        mach_port_deallocate(mach_task_self(), masterPort);
        return CANUSB_ERROR_FATAL;
    }
    /* Add the vendor and product IDs to the matching dictionary */
    numberRef = CFNumberCreate(kCFAllocatorDefault, kCFNumberSInt32Type, &vendorID);
    CFDictionarySetValue(matchingDict,  CFSTR(kUSBVendorID), numberRef);
    CFRelease(numberRef);
    numberRef = CFNumberCreate(kCFAllocatorDefault, kCFNumberSInt32Type, &productID);
    CFDictionarySetValue(matchingDict, CFSTR(kUSBProductID), numberRef);
    CFRelease(numberRef);
    numberRef = NULL;

    usbDriver.refRunLoop = CFRunLoopGetCurrent();
    //To set up asynchronous notifications, create a notification port and
    //add its run loop event source to the program�s run loop
    usbDriver.refNotifyPort = IONotificationPortCreate(masterPort);
    runLoopSource = IONotificationPortGetRunLoopSource(usbDriver.refNotifyPort);
    CFRunLoopAddSource(usbDriver.refRunLoop, runLoopSource,
                      kCFRunLoopDefaultMode);
    //Retain additional dictionary references because each call to
    //IOServiceAddMatchingNotification consumes one reference
    matchingDict = (CFMutableDictionaryRef) CFRetain(matchingDict);
    matchingDict = (CFMutableDictionaryRef) CFRetain(matchingDict);

    //Now set up two notifications: one to be called when a bulk test device
    //is first matched by the I/O Kit and another to be called when the
    //device is terminated.
    //Notification of first match
    (void)IOServiceAddMatchingNotification(usbDriver.refNotifyPort,
                  kIOFirstMatchNotification, matchingDict,
                  DeviceAdded, NULL, &usbDriver.iterBulkDevicePlugged);
    //Iterate over set of matching devices to access already-present devices
    //and to arm the notification
    DeviceAdded(NULL, usbDriver.iterBulkDevicePlugged);
    //Notification of termination
    (void)IOServiceAddMatchingNotification(usbDriver.refNotifyPort,
                  kIOTerminatedNotification, matchingDict,
                  DeviceRemoved, NULL, &usbDriver.iterBulkDeviceUnplugged);
    //Iterate over set of matching devices to release each one and to
    //arm the notification. NOTE: this function is not shown in this document.
    DeviceRemoved(NULL, usbDriver.iterBulkDeviceUnplugged);
    /* Finished with master port */
    mach_port_deallocate(mach_task_self(), masterPort);
    masterPort = 0;
    return 0;
}

static void DeviceAdded(void *refCon, io_iterator_t iterator)
{
    io_service_t            service;
    IOCFPlugInInterface     **plugInInterface = NULL;
    IOUSBDeviceInterface    **device=NULL;
    HRESULT                 result;
    SInt32                  score;
    UInt16                  vendor;
    UInt16                  product;
    UInt16                  release;
    UInt32                  location;
    USBDeviceAddress        address;
    UInt8                   speed;
    io_name_t               name;
    kern_return_t           kr;
    int index, found;
    const CANDEV_Device_t * canDevice;

    while ((service = IOIteratorNext(iterator)))
    {
        /* Get the USB device's name */
        kr = IORegistryEntryGetName(service, name);
        if (KERN_SUCCESS != kr) {
            name[0] = '\0';
        }
        /* Create an intermediate plug-in using the IOCreatePlugInInterfaceForService function */
        (void)IOCreatePlugInInterfaceForService(service, kIOUSBDeviceUserClientTypeID, kIOCFPlugInInterfaceID, &plugInInterface, &score);
        /* Release the device object after getting the intermediate plug-in */
        kr = IOObjectRelease(service);
        if ((kIOReturnSuccess != kr) || !plugInInterface)
        {
            MACCAN_DEBUG_ERROR("+++ IOCreatePlugInInterfaceForService returned 0x%08x.\n", kr);
            continue;
        }
        /* Create the device interface using the QueryInterface function */
        result = (*plugInInterface)->QueryInterface(plugInInterface, CFUUIDGetUUIDBytes(kIOUSBDeviceInterfaceID), (LPVOID *)&device);
        /* Release the intermediate plug-in object */
        (*plugInInterface)->Release(plugInInterface);
        if (result || !device)
        {
            MACCAN_DEBUG_ERROR("+++ Couldn't create a device interface (%08x).\n", (int)result);
            continue;
        }
        /* Check the vendor, product, and release number values to confirm we�ve got the right device */
        (void)(*device)->GetDeviceVendor(device, &vendor);
        (void)(*device)->GetDeviceProduct(device, &product);
        (void)(*device)->GetDeviceReleaseNumber(device, &release);
        (void)(*device)->GetLocationID(device, &location);
        (void)(*device)->GetDeviceAddress(device, &address);
        (void)(*device)->GetDeviceSpeed(device, &speed);
        if ((canDevice = CANDEV_GetDeviceById(vendor, product)) == NULL) {
            MACCAN_DEBUG_ERROR("+++ Found unwanted device (vendor = %03x, product = %03x)\n", vendor, product);
            (void)(*device)->Release(device);
            continue;
        }
        MACCAN_DEBUG_CORE("    - One device added at location %08x\n", location);

