mac-can/KvaserCAN-Library/Sources/MacCAN/MacCAN_IOUsbKit.c
        /* look for a free entry in the device list */
        for (index = 0, found = 0; (index < CANUSB_MAX_DEVICES) && !found; index++) {
            ENTER_CRITICAL_SECTION(index);
            if (!usbDevice[index].fPresent) {
                MACCAN_DEBUG_CORE("      - Device #%i: %s\n", index, name);
                MACCAN_DEBUG_CORE("        - Properties: vendor = %03x, product = %03x, release = %04x, speed = %d\n",
                                             vendor, product, release, speed);
                /* store the properties of the added device */
                bzero(&usbDevice[index].usbInterface, sizeof(USBInterface_t));
                usbDevice[index].usbInterface.fOpen = false;
                strcpy(usbDevice[index].szName, name);
                usbDevice[index].u16VendorId = vendor;
                usbDevice[index].u16ProductId = product;
                usbDevice[index].u16ReleaseNo = release;
                usbDevice[index].u32Location = location;
                usbDevice[index].u16Address = address;
                usbDevice[index].ioDevice = device;
                usbDevice[index].fPresent = true;
                found = 1;
                /* get number of CAN channels from device list */
                usbDevice[index].nCanChannels = CANDEV_GetNumChannels(canDevice);
                LEAVE_CRITICAL_SECTION(index);
                /* call the core callback function when a matching device has been added (if any) */
                CANDEV_DeviceAdded(canDevice, index, &usbDevice[index].ptrCanDevice);
            } else {
                /* entry already used */
                LEAVE_CRITICAL_SECTION(index);
            }
        }
        if (!found) {
            /* no free entry available */
            MACCAN_DEBUG_ERROR("+++ No free entry available for new device (vendor = %03x, product = %03x)\n", vendor, product);
            (void)(*device)->Release(device);
        }
    }
    (void)refCon;  /* to avoid warnings */
}

static void DeviceRemoved(void *refCon, io_iterator_t iterator)
{
    kern_return_t   kr;
    io_service_t    object;
    UInt64          location;
    CFTypeRef       locationCF;
    int index;

    while ((object = IOIteratorNext(iterator)))
    {
        /* Get the location from the i/o registry */
        locationCF = IORegistryEntryCreateCFProperty (object, CFSTR(kUSBDevicePropertyLocationID), kCFAllocatorDefault, 0);
        CFNumberGetValue(locationCF, kCFNumberLongType, (void *)&location);
        CFRelease (locationCF);

        /* Release the device object */
        kr = IOObjectRelease(object);
        if (kr != kIOReturnSuccess)
        {
            MACCAN_DEBUG_ERROR("+++ Couldn't release device object: %08x\n", kr);
            continue;
        }
        MACCAN_DEBUG_CORE("    - One device removed from location %08x\n", location);

        /* remove the device from the device list */
        for (index = 0; index < CANUSB_MAX_DEVICES; index++) {
            ENTER_CRITICAL_SECTION(index);
            if ((UInt32)location == usbDevice[index].u32Location) {
                MACCAN_DEBUG_CORE("      - Device #%i is %s available (vendor = %03x, product = %03x)\n", index,
                    usbDevice[index].fPresent? "no longer" : "not", usbDevice[index].u16VendorId, usbDevice[index].u16ProductId);
                if (usbDevice[index].fPresent &&
                    (usbDevice[index].ioDevice != NULL)) {
                    if (usbDevice[index].usbInterface.fOpen &&
                        (usbDevice[index].usbInterface.ioInterface != NULL) &&
                        (usbDevice[index].usbInterface.cbkDeviceRemoved != NULL)) {
                        LEAVE_CRITICAL_SECTION(index);
                        /* call the driver callback function when the device has been removed */
                        usbDevice[index].usbInterface.cbkDeviceRemoved(usbDevice[index].usbInterface.refDeviceRemoved);
                    } else {
                        /* note: all callbacks must be called outside the critical section! */
                        LEAVE_CRITICAL_SECTION(index);
                    }
                    /* call the core callback function when the device has been removed (if any) */
                    CANDEV_DeviceRemoved(CANDEV_GetDeviceById(usbDevice[index].u16VendorId, usbDevice[index].u16ProductId), index, &usbDevice[index].ptrCanDevice);
                    ENTER_CRITICAL_SECTION(index);
                }
                /* reset the properties of the removed device */
                bzero(&usbDevice[index].usbInterface, sizeof(USBInterface_t));
                usbDevice[index].usbInterface.fOpen = false;
                usbDevice[index].u16VendorId = 0x0U;
                usbDevice[index].u16ProductId = 0x0U;
                usbDevice[index].u16ReleaseNo = 0x0U;
                usbDevice[index].u32Location = 0x0U;
                usbDevice[index].u16Address = 0x0U;
                usbDevice[index].ioDevice = NULL;
                usbDevice[index].fPresent = false;
            }
            LEAVE_CRITICAL_SECTION(index);
        }
    }
    (void)refCon;  /* to avoid warnings */
}

static IOReturn ConfigureDevice(IOUSBDeviceInterface **dev)
{
    UInt8                           numConfig;
    IOReturn                        kr;
    IOUSBConfigurationDescriptorPtr configDesc;

    //Get the number of configurations. The sample code always chooses
    //the first configuration (at index 0) but your code may need a
    //different one
    kr = (*dev)->GetNumberOfConfigurations(dev, &numConfig);
    if (kr || !numConfig)
        return -1;
    //Get the configuration descriptor for index 0
    kr = (*dev)->GetConfigurationDescriptorPtr(dev, 0, &configDesc);
    if (kr)
    {
        MACCAN_DEBUG_ERROR("+++ Couldn't get configuration descriptor for index %d (err = %08x)\n", 0, kr);
        return kr;
    }
    //Set the device�s configuration. The configuration value is found in
    //the bConfigurationValue field of the configuration descriptor
    kr = (*dev)->SetConfiguration(dev, configDesc->bConfigurationValue);
    if (kr)
    {
        MACCAN_DEBUG_ERROR("+++ Couldn't set configuration to value %d (err = %08x)\n", 0, kr);
        return kr;
    }
    return kIOReturnSuccess;
}

static IOReturn FindInterface(IOUSBDeviceInterface **device, int index)
{
    IOReturn                    kr=0;
    IOUSBFindInterfaceRequest   request;
    io_iterator_t               iterator;
    io_service_t                usbInterface;
    IOCFPlugInInterface         **plugInInterface = NULL;
    IOUSBInterfaceInterface     **interface = NULL;
    HRESULT                     result;
    SInt32                      score;
    UInt8                       interfaceClass;
    UInt8                       interfaceSubClass;
    UInt8                       interfaceProtocol;
    UInt8                       interfaceNumEndpoints;
    CFRunLoopSourceRef          runLoopSource;
#if (OPTION_MACCAN_PIPE_INFO != 0)
    int                         pipeRef;
#endif

    /* Allow to find all the interfaces */
    request.bInterfaceClass = kIOUSBFindInterfaceDontCare;
    request.bInterfaceSubClass = kIOUSBFindInterfaceDontCare;
    request.bInterfaceProtocol = kIOUSBFindInterfaceDontCare;
    request.bAlternateSetting = kIOUSBFindInterfaceDontCare;
    /* Get an iterator for the interfaces on the device */
    kr = (*device)->CreateInterfaceIterator(device, &request, &iterator);
    if (kIOReturnSuccess != kr)
    {
        MACCAN_DEBUG_ERROR("+++ Unable to create interface iterator (%08x)\n", kr);
        return kr;
    }
    kr = kIOReturnError;
    while ((usbInterface = IOIteratorNext(iterator)))
    {
        /* Create an intermediate plug-in */
        (void)IOCreatePlugInInterfaceForService(usbInterface, kIOUSBInterfaceUserClientTypeID, kIOCFPlugInInterfaceID, &plugInInterface, &score);
        /* Release the usbInterface object after getting the plug-in */
        kr = IOObjectRelease(usbInterface);
        if ((kIOReturnSuccess != kr) || !plugInInterface)
        {
            MACCAN_DEBUG_ERROR("+++ Unable to create a plug-in (%08x)\n", kr);
            break;
        }
        /* Now create the device interface for the interface */
        result = (*plugInInterface)->QueryInterface(plugInInterface, CFUUIDGetUUIDBytes(kIOUSBInterfaceInterfaceID), (LPVOID *) &interface);
        /* No longer need the intermediate plug-in */
        (*plugInInterface)->Release(plugInInterface);
        if (result || !interface)
        {
            MACCAN_DEBUG_ERROR("+++ Couldn't create a device interface for the interface (%08x)\n", (int) result);
            break;
        }
        /* Get interface class and subclass */
        (void)(*interface)->GetInterfaceClass(interface, &interfaceClass);
        (void)(*interface)->GetInterfaceSubClass(interface, &interfaceSubClass);
        (void)(*interface)->GetInterfaceProtocol(interface, &interfaceProtocol);
        /* Now open the interface. This will cause the pipes associated with */
        /* the endpoints in the interface descriptor to be instantiated */
        kr = (*interface)->USBInterfaceOpen(interface);
        if (kIOReturnSuccess != kr)
        {
            MACCAN_DEBUG_ERROR("+++ Unable to open interface (%08x)\n", kr);
            (void)(*interface)->Release(interface);
            break;
        }
        /* Get the number of endpoints associated with this interface */
        kr = (*interface)->GetNumEndpoints(interface, &interfaceNumEndpoints);
        if (kIOReturnSuccess != kr)
        {
            MACCAN_DEBUG_ERROR("+++ Unable to get number of endpoints (%08x)\n", kr);
            (void)(*interface)->USBInterfaceClose(interface);
            (void)(*interface)->Release(interface);
            break;
        }
#if (OPTION_MACCAN_PIPE_INFO != 0)
        MACCAN_DEBUG_CORE("      - Interface class %d, subclass %d, protocol %d\n", interfaceClass, interfaceSubClass, interfaceProtocol);
        MACCAN_DEBUG_CORE("      - Interface has %d pipe(s):\n", interfaceNumEndpoints + 1);
        MACCAN_DEBUG_CORE("          - Pipe #0: default control pipe (for device requests)\n");
        /* Access each pipe in turn, starting with the pipe at index 1 */
        /* The pipe at index 0 is the default control pipe and should */
        /* be accessed using (*usbDevice)->DeviceRequest() instead */
        for (pipeRef = 1; pipeRef <= interfaceNumEndpoints; pipeRef++)
        {
            IOReturn        kr2;
            UInt8           direction;
            UInt8           number;
            UInt8           transferType;
            UInt16          maxPacketSize;
            UInt8           interval;
            char            *message;

            kr2 = (*interface)->GetPipeProperties(interface, pipeRef, &direction, &number, &transferType, &maxPacketSize, &interval);
            if (kIOReturnSuccess != kr2)
                MACCAN_DEBUG_ERROR("+++ Unable to get properties of pipe #%d (%08x)\n", pipeRef, kr2);
            else
            {
                MACCAN_DEBUG_CORE("          - Pipe #%d: ", pipeRef);
                switch (direction)
                {
                    case kUSBOut:     message = "out"; break;
                    case kUSBIn:      message = "in"; break;
                    case kUSBNone:    message = "none"; break;
                    case kUSBAnyDirn: message = "any"; break;
                    default:          message = "???"; break;
                }
                MACCAN_DEBUG_CORE("direction %s, ", message);
                switch (transferType)
                {
                    case kUSBControl:   message = "control"; break;
                    case kUSBIsoc:      message = "isoc"; break;
                    case kUSBBulk:      message = "bulk"; break;
                    case kUSBInterrupt: message = "interrupt"; break;
                    case kUSBAnyType:   message = "any"; break;
                    default:            message = "???"; break;
                }
                MACCAN_DEBUG_CORE("transfer type %s, max. packet size %d, interval %ums\n", message, maxPacketSize, interval);
            }
        }
#endif
        /* For this test, just use first interface, so exit loop */
        if (IS_INDEX_VALID(index)) {
            usbDevice[index].usbInterface.ioInterface = interface;
            usbDevice[index].usbInterface.u8Class = interfaceClass;
            usbDevice[index].usbInterface.u8SubClass = interfaceSubClass;
            usbDevice[index].usbInterface.u8Protocol = interfaceProtocol;
            usbDevice[index].usbInterface.u8NumEndpoints = interfaceNumEndpoints;
            /* As with service matching notifications, to receive asynchronous */
            /* I/O completion notifications, you must create an event source and */
            /* add it to the run loop */
            kr = (*interface)->CreateInterfaceAsyncEventSource(
                                    interface, &runLoopSource);
            if (kr != kIOReturnSuccess)
            {
                MACCAN_DEBUG_ERROR("+++ Unable to create asynchronous event source for device #%i (%08x)\n", index, kr);
                (void)(*interface)->USBInterfaceClose(interface);
                (void)(*interface)->Release(interface);
                break;
            }
            CFRunLoopAddSource(usbDriver.refRunLoop, runLoopSource,
                                    kCFRunLoopDefaultMode);
            MACCAN_DEBUG_CORE("      + Device #%i: asynchronous event source added to run loop\n", index);
            /* the USB interface can now be used */
            usbDevice[index].usbInterface.fOpen = true;
            kr = kIOReturnSuccess;
        }
        else
        {
            (void)(*interface)->USBInterfaceClose(interface);
            (void)(*interface)->Release(interface);
            kr = kIOReturnError;
        }
        break;
    }
    /* Clean up used resources */
    (void)IOObjectRelease(iterator);
    return kr;
}

static void* WorkerThread(void* arg)
{
    const CANDEV_Device_t *ptrDevice = CANDEV_GetFirstDevice();
    (void)arg;  /* to avoid compiler warnings */

    /* set up the IOUSBKit to manage and access CAN to USB devices */
    while (ptrDevice) {
        if (SetupDirectory((SInt32)ptrDevice->vendorId,
                           (SInt32)ptrDevice->productId) != 0)
            goto exit_worker_thread;
        ptrDevice = CANDEV_GetNextDevice();
    }
    /* indicate to the creator that the thread is running */
    assert(0 == pthread_mutex_lock(&usbDriver.ptMutex));
    usbDriver.fRunning = TRUE;
    assert(0 == pthread_mutex_unlock(&usbDriver.ptMutex));

    /* start the run loop so notifications will be received */
    MACCAN_DEBUG_CORE("    - Run loop started so notifications will be received\n");
    CFRunLoopRun();

    /* indicate to the creator that the thread is terminated */
    MACCAN_DEBUG_CORE("    - So long, and thanks for all the fish!\n");
    assert(0 == pthread_mutex_lock(&usbDriver.ptMutex));
    usbDriver.fRunning = FALSE;
    assert(0 == pthread_mutex_unlock(&usbDriver.ptMutex));
exit_worker_thread:
    /* terminate the thread */
    pthread_exit(NULL);
    return NULL;
}

/* * $Id: MacCAN_IOUsbKit.c 2028 2024-08-16 08:24:21Z makemake $ *** (c) UV Software, Berlin ***
 */
